app/Controllers/Expedientes.php

SELECT *
FROM `expedientes`
WHERE `expedientes`.`id` = 1
---
    public function edit(int $id)
    {
        $paciente = $this->Expedientes->find($id);