app/Controllers/Expedientes.php

    public function index()
    {
        $expedientes = $this->expedientes->findAll();
---
SELECT *
FROM `expedientes`

    public function detalles(int $id)
    {
        // Obtener expediente con datos del paciente y médico mediante JOIN
        $expediente = $this->expedientes
        ->select('
            expedientes.*,
            pacientes.nombre AS paciente_nombre,
            pacientes.apellidos AS paciente_apellidos,
            usuarios.nombre AS medico_nombre,
            usuarios.telefono AS medico_telefono
        ')
        ->join('pacientes', 'pacientes.id = expedientes.paciente_id')
        ->join('usuarios', 'usuarios.id = expedientes.creado_por')
        ->where('expedientes.id', $id)
        ->asArray()
        ->first();

        // Validación: si no existe el expediente, redirigir con error
        if (! $expediente) {
            return redirect()->to('/expedientes')->with('error', 'Expediente no encontrado.');
        }

        $consultas = $this->consultas->where('expediente_id', $id)->findAll();
---
SELECT *
FROM `consultas`
WHERE `expediente_id` = 1