app/Controllers/Horarios.php

public function index()
{


    $medicos = $this->usuarios->where('role_id', 2)->findAll();
    $horarios = $this->horarios->findAll();
---
SELECT *
FROM `usuarios`
WHERE `role_id` = 2
SELECT `horarios`.*, `usuarios`.`nombre` AS `medico_nombre`
FROM `horarios`
JOIN `usuarios` ON `usuarios`.`id` = `horarios`.`medico_id`

public function disponibilidadPorFecha($medicoId, $fecha)
{
    // Obtener el número del día de la semana según tu formato
    // Lunes = 1, Domingo = 7
    $diaSemana = date('N', strtotime($fecha));

    // Buscar el horario del médico para ese día
    $horario = $this->horarios
        ->where('medico_id', $medicoId)
        ->where('dia_semana', $diaSemana)
        ->first();

    if (!$horario) {
        return $this->response->setJSON([
            'disponibilidad' => [],
            'error' => 'El médico no tiene horario ese día.'
        ]);
    }

    $horaInicio = $horario['hora_inicio'];
    $horaFin = $horario['hora_fin'];

    // Buscar citas para ese médico en ese día
    $citas = $this->citas
        ->where('medico_id', $medicoId)
        ->where('estado', 'confirmada')
        ->where("DATE(fecha_inicio)", $fecha)
        ->orderBy('fecha_inicio', 'ASC')
        ->findAll();
---
SELECT *
FROM `horarios`
WHERE `medico_id` = '5'
AND `dia_semana` = '1'
 LIMIT 1
SELECT *
FROM `citas`
WHERE `medico_id` = '5'
AND `estado` = 'confirmada'
AND DAYOFWEEK(fecha_inicio) = 2
AND   (
TIME(fecha_inicio) < '15:00:00'
AND TIME(fecha_fin) > '12:00:00'
 )