app/Controllers/Pacientes.php

SELECT *
FROM `pacientes`
---
    public function index()
    {
        $pacientes = $this->pacientes->findAll();

SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = 1
---
    public function edit(int $id)
    {
        $paciente = $this->pacientes->find($id);