app/Controllers/Usuarios.php

    private function attemptLogin()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required',
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->usuarios
            ->where(['email' => $email, 'activo' => 1])
            ->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'medico@demo.com'
AND `activo` = 1
 LIMIT 1